config.org
* Doom Literate Config

** General Options
*** Lexical binding

 #+begin_src emacs-lisp
;;; -*- lexical-binding: t; -*-
 #+end_src
*** Performance
#+begin_src emacs-lisp
(setq gc-cons-threshold 100000000
      read-process-output-max (* 1024 1024))

#+end_src
*** Large file warning
Let's disable warning about opening large files
#+begin_src emacs-lisp
(setq large-file-warning-threshold nil)
#+end_src
*** Theme

#+BEGIN_SRC emacs-lisp
(setq
 doom-font (font-spec :family "SauceCodePro Nerd Font Mono" :size 18)
 doom-big-font (font-spec :family "Ubuntu" :size 15)
 doom-big-font (font-spec :family "SauceCodePro Nerd Font Mono" :size 24))

(defvar my/theme-light 'doom-one-light "The default light theme")
(defvar my/theme-dark 'doom-one "The default dark theme")
(defvar my/theme-selected 'doom-one "The selected theme")

(defun my/toggle-theme ()
  "Toggle between light and dark theme."
  (interactive)
  (if (eq my/theme-selected my/theme-dark)
      (setq my/theme-selected my/theme-light)
    (setq my/theme-selected my/theme-dark))
  (load-theme my/theme-selected))
#+END_SRC

*** Screens

#+begin_src emacs-lisp
(defun my/laptop-mode()
  "Modify theme for latpop use."
  (interactive)
  (set-face-attribute 'default nil :height 75)
  (when (boundp 'treemacs-root-face)
    (set-face-attribute 'treemacs-root-face nil :height 90)))

(defun my/desktop-mode()
  "Modify theme for latpop use."
  (interactive)
  (set-face-attribute 'default nil :height 130)
  (when (boundp 'treemacs-root-face)
    (set-face-attribute 'treemacs-root-face nil :height 130)))

(defun my/comf-mode()
  "Modify theme for comfortable use."
  (interactive)
  (set-face-attribute 'default nil :height 150)
  (set-face-attribute 'default nil :width 'ultra-expanded)
  (when (boundp 'treemacs-root-face)
    (set-face-attribute 'treemacs-root-face nil :height 160)))

(defun my/presentation-mode()
  "Modify theme for presentations use."
  (interactive)
  (set-face-attribute 'default nil :height 250)
  (when (boundp 'treemacs-root-face)
    (set-face-attribute 'treemacs-root-face nil :height 260)))

(defun my/asciinema-mode()
  "Modify theme for asciinema use."
  (interactive)
  (setq mode-line-format nil)
  (setq-default mode-line-format nil)
  (setq idee-tree-enabled nil)
  (setq inhibit-message t)
  (setq-default inhibit-message t)
  (set-face-attribute 'default nil :height 150)
  (when (boundp 'treemacs-root-face)
    (set-face-attribute 'treemacs-root-face nil :height 160)))

(defvar my/selected-screen-mode 'my/comf-mode "The current screen mode to use.")
(funcall my/selected-screen-mode)
#+end_src

*** Battery indicator
#+BEGIN_SRC emacs-lisp
(display-battery-mode 1)
#+END_SRC

*** Buffers

#+begin_src emacs-lisp
(map! "C-x C-k" #'kill-current-buffer)
(map! "C-x C-b" #'switch-to-buffer)
#+end_src

*** Editor

**** Search in buffer

I used to use `swiper`. Nowdays it seems that `consult-line is a better choice`.

#+begin_src emacs-lisp
  (defun my/consult-line-with-selection (&optional start end)
    "Swiper variation using selected from START to END text as initial input."
    (interactive (if (use-region-p) (list (region-beginning) (region-end))))
    (let (
          (start (or start (if (use-region-p) (region-beginning) nil)))
          (end (or end (if (use-region-p) (region-end) nil))))
      (if (and (use-region-p) start end)
          (consult-line (buffer-substring start end))
        (consult-line))))

(map! "C-s" #'my/consult-line-with-selection)
(map! "C-a" #'consult-line-multi)
#+end_src

**** Search in project

There are a lot of different tools for searching in project:

- [[+vertico/project-search]] (recommended)
- [[consult-ag]] (disabled: no editing of search buffer)

At the moment I prefer the use of [[+vertico/project-search]] as it works out of the box as expected.

***** +vertico/project-search

Features:
- search with selection
- editing search buffer (implementing search & replace)

#+begin_src emacs-lisp
(map! "C-c i g" #'+vertico/project-search)
#+end_src

***** COMMENT consult-ag

Install `consult-ag` to be able to search within a project and override function label.

#+begin_src emacs-lisp
(use-package! consult-ag
  :config
  (defun my/consult-ag (&optional target initial)
    "Consult ag for query in TARGET file(s) with INITIAL input."
    (interactive (if (use-region-p) (list (region-beginning) (region-end))))
    (let* ((start (if (use-region-p) (region-beginning) nil))
           (end (if (use-region-p) (region-end) nil))
           (prompt-dir (consult--directory-prompt "Search: " target))
           (default-directory (cdr prompt-dir)))
      (consult--read (consult--async-command #'consult-ag--builder
                       (consult--async-map #'consult-ag--format))
                     :prompt (car prompt-dir)
                     :lookup #'consult--lookup-member
                     :state (consult-ag--grep-state)
                     :initial (consult--async-split-initial (or initial (if (and (use-region-p) start end) (buffer-substring start end) nil)))
                     :require-match t
                     :category 'file
                     :sort nil)))

  (defun my/consult-ag-with-selection (&optional start end)
    "Consult ag for query in TARGET file(s) with INITIAL input."
    (interactive (if (use-region-p) (list (region-beginning) (region-end))))
    (let* ((start (if (use-region-p) (region-beginning) nil))
           (end (if (use-region-p) (region-end) nil)))
      (if (and (use-region-p) start end)
          (my/consult-ag nil (buffer-substring start end))
        (my/consult-ag))))
  :bind ("C-c i g" . my/consult-ag-with-selection))
#+end_src


**** Line numbers
#+BEGIN_SRC emacs-lisp
(setq display-line-numbers-type 'relative)
#+END_SRC

**** Multiple cursors

#+begin_src emacs-lisp
(map!
 "C-q" #'er/expand-region
 "C-c m m" #'mc/mark-next-like-this
 "C-c m u" #'mc/umark-next-like-this
 "C-c m s" #'mc/skip-next-like-this
 "C-c m e" #'mc/edit-lines)
#+end_src

*** File Manager
**** Dired subtree
***** Installation

#+begin_src emacs-lisp
(use-package! dired-subtree
    :commands (dired-subtree-toggle dired-subtree-cycle)
    :config
    :bind (:map dired-mode-map
                ("<tab>" . dired-subtree-toggle)
                ("<backtab>" . dired-subtree-cycle)))
#+end_src
***** Extension

#+begin_src emacs-lisp
(defun my/dired-expand-all ()
  (interactive)
  "Expand all subtrees in the dired buffer."
  (let ((has-more t))
    (while has-more
      (condition-case ex
          (progn
            (dired-next-dirline 1)
            (dired-subtree-toggle))
        ('error (setq has-more nil))))))

(map! :map dired-mode-map "S-<tab>" #'my/dired-expand-all)
#+end_src

*** Project
**** Projectile
***** Project root handling

Let's remove `.project` out of the list of project root markers.
We start with this code: https://github.com/doomemacs/doomemacs/blob/master/lisp/doom-projects.el#L80
and just remove the ".project" from the list:

#+begin_src emacs-lisp
(after! projectile
  (setq! projectile-project-root-functions '(projectile-root-local projectile-root-bottom-up))
  (setq! projectile-project-root-files-bottom-up
      (append '(".projectile" ".git"))))
#+end_src

*** Auth Sources

#+begin_src emacs-lisp
(setq! auth-sources '("~/.authinfo" "~/.authinfo.gpg" "~/.netrc"))
#+end_src

** Navigation

*** Split and follow

#+begin_src emacs-lisp
(defadvice! horizontal-split-and-follow (&rest args)
  "Switch focus to the newly created window when splitting horizontally."
  :after '(split-window-horizontally split-window-right)
  (balance-windows)
  (other-window 1))

(defadvice! vertical-split-and-follow (&rest args)
  "Switch focus to the newly created window when splitting vertically."
  :after '(split-window-vertically split-window-below)
  (balance-windows)
  (other-window 1))
#+end_src

*** Bindings

#+begin_src emacs-lisp
(map! "M-o" #'evil-window-next)
#+end_src

** Org Mode
*** Org Agenda

**** Configuration
#+begin_src emacs-lisp
(setq org-agenda-files (append
                        '("~/Documents/org/quickmarks.org"
                          "~/Documents/org/github.org"
                          "~/Documents/org/habits.org"
                          "~/Documents/org/nutrition.org")
                          (directory-files-recursively "~/Documents/org/gtg" "\.org$")
                          (directory-files-recursively "~/Documents/org/jira" "\.org$")))
#+end_src

**** Functions
#+begin_src emacs-lisp
  (defun my/org-agenda-browse-at-point ()
    "Browse  the url of the specified item."
    (interactive)
    (let ((agenda-window-configuration (current-window-configuration)))
      (org-agenda-switch-to)
      (let ((url (car
                  (mapcar (lambda (p) (replace-regexp-in-string (regexp-quote "\"") "" (org-entry-get (point) p)))
                          (seq-filter (lambda (n) (string-suffix-p "url" n t))
                                      (mapcar (lambda (e) (car e)) (org-entry-properties)))))))
        (when url (browse-url  url)))
      (set-window-configuration agenda-window-configuration)))

  (defun my/org-agenda-archive-at-point ()
    "Browse  the url of the specified item."
    (interactive)
    (let ((agenda-window-configuration (current-window-configuration)))
      (org-agenda-switch-to)
      (my/org-archive)
      (set-window-configuration agenda-window-configuration)))

  (defun my/org-agenda-export ()
    "Export the content of org-agenda"
    (interactive)
    (org-eval-in-environment (org-make-parameter-alist
                              `(org-agenda-span 'day
                                                org-agenda-use-time-grid t
                                                org-agenda-remove-tags t
                                                org-agenda-window-setup 'nope))
      (let* ((wins (current-window-configuration))
             org-agenda-sticky)
        (save-excursion
          (with-current-buffer
              (get-buffer-create org-agenda-buffer-name)
            (pop-to-buffer (current-buffer))
            (org-agenda nil "t")
            (let ((result (buffer-string)))
              (with-temp-file "~/.agenda" (insert result)))))
        (set-window-configuration wins))))

  (defun my/org-refile (file headline &optional new-state)
    "Refile item to the target FILE under the HEADLINE and set the NEW-STATE."
    (let ((pos (save-excursion
                 (find-file file)
                 (org-find-exact-headline-in-buffer headline))))
      (save-excursion
        (org-refile nil nil (list headline file nil pos))
        (org-refile-goto-last-stored)
        (when new-state (org-todo new-state)))))

  (defun my/org-archive ()
    "Mark item as complete and refile to archieve."
    (interactive)
    (let ((archive-headline (or (org-entry-get (point) "archive-headline") "Unsorted")))
      (my/org-refile "~/Documents/org/para/archives.org" archive-headline "DONE")))
#+end_src
