config.org
*** Org Tree Slide
#+begin_src emacs-lisp
;;;###autoload
(defun +org-present-hide-blocks-h ()
  "Hide org #+ constructs."
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward "^[[:space:]]*\\(#\\+\\)\\(\\(?:BEGIN\\|END\\|ATTR\\)[^[:space:]]+\\).*" nil t)
      (org-flag-region (match-beginning 1)
                       (match-end 0)
                       org-tree-slide-mode
                       'block))))

;;;###autoload
(defun +org-present-hide-leading-stars-h ()
  "Hide leading stars in headings."
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward "^\\(\\*+\\)" nil t)
      (org-flag-region (match-beginning 1)
                       (match-end 1)
                       org-tree-slide-mode
                       'headline))))
#+end_src

*** Org Hugo

**** Configuration

#+begin_src emacs-lisp
(setq org-hugo-base-dir "~/workspace/src/github.com/iocanel/iocanel.github.io")
#+end_src

**** Customization

#+begin_src emacs-lisp
(defun my/org-hugo-set-export-file-name ()
  "Set the export file name to index.md."
  (interactive)
  (let ((name (file-name-nondirectory (directory-file-name (file-name-directory buffer-file-name)))))
    (save-excursion
      (goto-char 0)
      (if (re-search-forward "^#\\+EXPORT_FILE_NAME" nil t)
          (progn
            (move-beginning-of-line 1)
            (kill-line))
        (progn
          (while (string-prefix-p "#+" (buffer-substring (bol) (eol)))
            (next-line 1))
          (previous-line 1)
          (move-end-of-line 1)
          (insert "\n")))
        (insert "#+EXPORT_FILE_NAME: index.md"))))

(defun my/org-hugo-set-bundle ()
  "Set the hugo bundle property to match the directory."
  (interactive)
  (let ((name (file-name-nondirectory (directory-file-name (file-name-directory buffer-file-name)))))
    (save-excursion
      (goto-char 0)
      (if (re-search-forward "^#\\+HUGO_BUNDLE" nil t)
          (progn
            (move-beginning-of-line 1)
            (kill-line))
        (progn
          (while (string-prefix-p "#+" (buffer-substring (bol) (eol)))
            (next-line 1))
          (previous-line 1)
          (move-end-of-line 1)
          (insert "\n")))
        (insert (format! "#+HUGO_BUNDLE: %s" name)))))

(defun my/org-hugo-prepare()
  "Prepare document for export via ox-hugo."
  (interactive)
  (my/org-hugo-set-bundle)
  (my/org-hugo-set-export-file-name))
#+end_src

*** Code Block Navigation and Evaluation
**** Functions

#+begin_src emacs-lisp
;;;###autoload
(defun my/next-code-block ()
  "Jump to the next code block."
  (interactive)
  (re-search-forward "^[[:space:]]*\\(#\\+begin_src\\)" nil t)
  (next-line)
  (beginning-of-line))

;;;###autoload
(defun my/previous-code-block ()
  "Jump to the next code block."
  (interactive)
  (re-search-backward "^[[:space:]]*\\(#\\+end_src\\)" nil t)
  (re-search-backward "^[[:space:]]*\\(#\\+begin_src\\)" nil t)
  (next-line)
  (beginning-of-line))

;;;###autoload
(defun my/code-block-p ()
  "Return non-nil if in code block."
  (let* ((previous-end-pos (save-excursion
                             (progn (re-search-backward "^[[:space:]]*\\(#\\+end_src\\)" nil t)
                                    (point))))
         (previous-begin-pos (save-excursion (progn (re-search-backward "^[[:space:]]*\\(#\\+begin_src\\)" nil t)
                                                      (point)))))
     (or (eq previous-end-pos (point)) (> previous-begin-pos previous-end-pos))))

;;;###autoload
(defun my/ensure-in-code-block ()
    "Jump to the next code block if not current not in code block."
    (interactive)
    (when (not (my/code-block-p))
      (my/next-code-block)))
#+end_src
**** Mappings

#+begin_src emacs-lisp
(map! :map org-mode-map
      "M-p" #'my/previous-code-block
      "M-n" #'my/next-code-block
      "M-r" #'+eval:open-repl-other-window)
#+end_src

*** Animated Images

Credits: https://ivanaf.com/animating_gifs_in_orgmode.html

#+begin_src emacs-lisp
(defun my/org-inline-image--get-current-image ()
  "Return the overlay associated with the image under point."
  (car (-select (lambda (i) (eq (overlay-get i 'org-image-overlay) t)) (overlays-at (point)))))

(defun my/org-inline-image--get (prop)
  "Return the value of property PROP for image under point."
  (let ((image (my/org-inline-image--get-current-image)))
    (when image
      (overlay-get image prop))))

(defun my/org-inline-image-animate ()
  "Animate the image if it's possible."
  (interactive)
  (let ((image-props (my/org-inline-image--get 'display)))
    (when (image-multi-frame-p image-props)
      (image-animate image-props))))

(defun my/org-inline-image-animate-auto ()
  "Automatically animate image inlined in org-mode."
  (interactive)
  (when (eq 'org-mode major-mode)
    (while-no-input
      (run-with-idle-timer 0.3 nil 'my/org-inline-image-animate))))

(setq org-inline-image--get-current-image (byte-compile 'my/org-inline-image--get-current-image))
(setq org-inline-image-animate  (byte-compile 'my/org-inline-image-animate ))
#+end_src

** Tools
*** Language Server Protocol (LSP)
****  LSP tuning

Following tips from: https://emacs-lsp.github.io/lsp-mode/page/performance/

#+begin_src emacs-lisp
(setq lsp-idle-delay 0.500)
(setq lsp-log-io nil) ; if set to true can cause a performance hit
#+end_src
**** LSP Treemacs integration
To keep lsp workspace and treemacs aligned.
#+begin_src emacs-lisp
(after! lsp-treemacs
  (lsp-treemacs-sync-mode 1))
#+end_src
**** LSP Bindings

#+begin_src emacs-lisp
(setq lsp-keymap-prefix "C-c l")

(map! :map lsp-mode-map
      (:leader
       (:prefix "l"
                :desc "Lsp" "l" #'lsp-mode
                :desc "Lsp Rename" "r" #'lsp-rename
                :desc "Lsp Find Symbol" "s" #'lsp-ui-find-workspace-symbol
                :desc "Lsp Find References" "r" #'lsp-find-references
                :desc "Lsp Find Implementations" "i" #'lsp-find-implementation
                :desc "Lsp Find Declaration" "d" #'lsp-find-declaration)))

#+end_src

*** Dap

#+begin_src emacs-lisp
(map! :map lsp-mode-map
      (:leader
       (:prefix "d"
                :desc "Dap Hydra" "h" #'dap-hydra
                :desc "Dap Debug" "d" #'dap-debug
                :desc "Dap Debug Last" "l" #'dap-debug-last
                :desc "Dap Debug Restart" "r" #'dap-debug-restart
                :desc "Continue" "c" #'dap-continue
                :desc "Step in" "i" #'dap-step-in
                :desc "Step in" "o" #'dap-step-out
                :desc "Toggle breakpoint" "b" #'dap-breakpoint-toggle
                :desc "Breakpoint condition" "c" #'dap-breakpoint-condition
                :desc "Delete all breakpoints" "D" #'dap-breakpoint-delete-all)))

#+end_src

** Programming
*** General
**** Indentation and tab width

#+begin_src emacs-lisp
(setq c-basic-offset 2
      tab-width 2)
#+end_src

*** Java
**** Java LSP tuning
#+begin_src emacs-lisp
  (setq
   lsp-java-vmargs '("-XX:+UseAdaptiveSizePolicy" "-XX:GCTimeRatio=4" "-XX:AdaptiveSizePolicyWeight=90" "-Xmx8G" "-Xms2G" "-Xverify:none" "-jar")
   lsp-java-java-path "/home/iocanel/.sdkman/candidates/java/current/bin/java"
   lsp-java-save-action-organize-imports nil
   lsp-java-autobuild-enabled nil
   lsp-java-maven-download-sources t
   lsp-java-import-maven-enabled nil
   lsp-java-import-gradle-enabled nil
   lsp-java-max-concurrent-builds 1
   lsp-inhibit-message nil
   lsp-java-format-on-type-enabled nil
   lsp-java-completion-guess-arguments t
   lsp-java-completion-overwrite nil
   c-basic-offset 2
   tab-width 2)
#+end_src
**** Snippets

Add IDEE snippets to `yas-snippet-dirs`

 #+begin_src emacs-lisp
;;(add-to-list 'yas-snippet-dirs '(idee/emacs-snippets-dir idee/emacs-templates-dir))
 #+end_src

**** Maven integration

#+begin_src emacs-lisp
(map!
    :leader
    "m" #'idee/maven-hydra/body)
#+end_src

** Utilities
*** Quickmarks
A simple tool quickly get url, logo or avatar by name.
#+begin_src emacs-lisp
(use-package! quickmarks
  :commands (qm-init qm-install qm-avatar-by-name qm-logo-by-name qm-url-by-name)
  :config
  (setq! qm-org-capture-file "~/Documents/org/quickmarks.org")
  (setq! qm-src-dir (concat (file-name-as-directory (concat (file-name-as-directory (concat (file-name-as-directory straight-base-dir)  "straight")) "repos")) "quickmarks.el"))
  (setq! qm-snippet-dir +snippets-dir)
  (qm-init))
#+end_src

*** Imgflip
Imgflip API client for Emacs Lisp with Yasnippet integration
#+begin_src emacs-lisp
(use-package! imgflip
  :commands (qm-init qm-avatar-by-name qm-logo-by-name qm-url-by-name)
  :config
  (qm-init))
#+end_src

*** Openwith

#+begin_src emacs-lisp
(use-package! openwith
  :config
  (setq openwith-associations
        (list
         (list (openwith-make-extension-regexp
                '("mpg" "mpeg" "mp3" "mp4"
                  "avi" "wmv" "wav" "mov" "flv"
                  "ogm" "ogg" "mkv"))
               "mpv"
               '(file))
         (list (openwith-make-extension-regexp
                '("xbm" "pbm" "pgm" "ppm" "pnm"
                  "png" "gif" "bmp" "tif" "jpeg" "jpg"))
               "geeqie"
               '(file))
         ))
(openwith-mode 1))
#+end_src

** Email
